---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCAggregate
source: html/06bbeb56-efc6-1810-3111-f8ab4f615da1.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate

A collection of IFC handles or attributes.

## Syntax (C#)
```csharp
public class IFCAggregate : IEnumerable<IFCData>,
	IDisposable
```